[
    {
        "category": "Programming Languages",
        "description": "As someone who regularly codes, I work a lot with programming languages. These languages are a few of my favorite ones due to how much I enjoyed working in them. While none of these languages are 'perfect', they have changed my way of thinking and improved my ability to code. If I had to dream up an ideal language, it would incorporate elements from all of these languages. It would also be called IdeaLang, which is quite ideal.",
        "items": [
            {
                "name": "The D Language",
                "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/D_Programming_Language_logo.svg/1200px-D_Programming_Language_logo.svg.png",
                "description": "The D Programming language is tied for my favorite langauge. It is just super consistent and nice to work with. It is very predictable and powerful. While I may not know much about D as a replacement for C++, I find that it works as an excellent replacement for Java. The feature I love most about D is its extremely capable meta-programming. Compile-time function execution along with flexible templates allow for much to be done during compile-time rather than run-time. It also makes programming easy by allowing optional parentheses for function calls, and allows for universal function call syntax. Instead of add(5, add(4, add(3, 2)));, where you would need to read from inside to out, you can do 2.add(3).add(4).add(5);. Universal function call syntax is nice because it allows one to read left to right. Overall, D is a nice language. The only issues I have with it are that it has a small community, and D libraries and extra functionalities are lacking. Furthermore, D can only compile for desktop environments, and mobile compilation is still quite difficult. This makes D still feel like its in its infancy stage, despite existing for well over a decade."
            },
            {
                "name": "Kotlin",
                "image": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Kotlin-logo.png",
                "description": "Kotlin is really nice to use. It makes coding with it much easier and less taxing to the programmer. I love how this language handles nullity, which is, allowing every type to be null, but only if the variable of the type is declared as nullable beforehand. This means that Integers and Booleans can be nulled if the variable that is holding the Integer or Boolean is declared as nullable. This syntax however is even more powerful in that one can guard against null pointer exceptions in the compile-time phase rather than the run-time phase due to nullity being a part of the type. I also love how this language treats the 'val' keyword as non-reassignable, but permits the use of 'var' when reassignment is necessary. This allows for one to take as much advantage of functional purity as they can. Furthermore, this language is great in terms of what it can do. My only complaints with Kotlin are that its lack of meta-programming and the fact that it runs on the JVM, so doing things like connecting with SQL become really ugly and much of the generated JVM bytecode runs inefficiently on the JVM. You can tell I really like this language because that is what this website was made in!"
            },
            {
                "name": "Python",
                "image": "https://www.python.org/static/opengraph-icon-200x200.png",
                "description": "Python is a really nice language overall for quick and fun little scripts and small projects. Python has many use cases, and even more libraries. I really like this language for its ease of use and flexibility. Regardless, I dislike the lack of the type system, which is inherent to Python. Some of its smaller warts include that class methods need 'self' as the first parameter, and doing complicated things like making anonymous classes and using functions as first class objects are difficult and have an ugly syntax. Furthermore, Python doesn't lend itself to being a fast language. My last issue with Python is that I dislike using whitespace as a language feature, and I hate the PEP8 standard even more: this makes my code hard to use for me because I can't often make it in my style. However, one cannot dislike the quickness of anyone to pick up Python and start scripting."
            }
        ]
    },
    {
        "category": "TV Shows",
        "description": "I spend a large amount of my time watching television. These shows either all impacted me and my way of looking at things or just were genuinely very interesting to watch. I really enjoy shows with a large or rich world, as world building is one of my favorite aspects of any fictional universe.",
        "items": [
            {
                "name": "Hunter x Hunter",
                "image": "https://img1.ak.crunchyroll.com/i/spire3/cbb55a6382682bf71e91f685c6473c5a1487736090_full.jpg",
                "description": "'Unfinished Greatness' is the most accurate description of this show that I have heard. Hunter x Hunter starts off deceptively simple, but grows into a huge sprawling story with many loose ends. Every character is independent and has relations to many other characters. I initially didn't like this show because it seemed simple and happy and for little kids, but I soon learned that this show was quite the opposite. It soon turned into something really dark and philosophically interesting. Many times I found myself questioning whether the main characters were in the 'morally right', and I often couldn't justify their actions. This show is one of my favorite shows of all time. My issue with Hunter x Hunter is that it is a little tough to get into, and it doesn't make for a good start into anime because of that."
            },
            {
                "name": "Made in Abyss",
                "image": "https://myanimelist.cdn-dena.com/images/anime/1922/91900.jpg",
                "description": "I value world-building greatly for any story. By far, Made in Abyss has the best world-building of any show I have ever seen. The drawings for the world are beautiful, and the lore behind everything is deep and multi-faceted. I love learning about the lore of the story, and it feels like there is a real history behind this world. I also love the story for this show, as it can get very serious at times, but lighthearted at other times. This show is emotionally taxing, but well worth it in my book. My only issue with this show is its excessive nudity."
            },
            {
                "name": "Fullmetal Alchemist: Brotherhood",
                "image": "https://vignette.wikia.nocookie.net/fma/images/e/e9/Fmab-poster.png/revision/latest?cb=20131124145205",
                "description": "If I want to recommend anyone with a beginner anime, I always recommend people to start off with Fullmetal Alchemist: Brotherhood. This show is just so unbelievably good in so many ways. The world-building is excellent, and seemingly minute or irrelevant details later become some of the key points of the plot. Furthermore, the characterization is just handled so well and the characters always act within how one could expect them to act. I love mostly everything about Fullmetal Alchemist: Brotherhood as it gets basically everything right. It isn't the greatest show in existence, but it makes covering topics such as war, genocide, racism, amputations, and death enjoyable."
            },
            {
                "name": "The 100",
                "image": "https://vignette.wikia.nocookie.net/thehundred/images/0/0d/The-100-poster.png/revision/latest?cb=20140410034446",
                "description": "I usually don't enjoy drama-infused shows, but The 100 is actually really enjoyable. I enjoy the story as the plot is enjoyable, but I dislike how much of the story is scientifically inaccurate. I don't have much to say about this show other than it is pretty decent."
            },
            {
                "name": "Game of Thrones",
                "image": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d8/Game_of_Thrones_title_card.jpg/250px-Game_of_Thrones_title_card.jpg",
                "description": "Game of Thrones is not critically acclaimed for nothing. From beginning to end, each episode of Game of Thrones is good. To start off, the intro theme is impossible to stop listening to, but throughout the episode, I enjoy the divergent character arcs each getting small amounts of screen time every episode. It gives the feel of building a whole story that involves multiple sides, rather than just one person or kingdom's quest. I thoroughly enjoy the story and rampant death and violence throughout each episode. I also enjoy the aspect of Magical Realism present throughout the show with things such as White Walkers and Dragons as it adds an extra layer of intrigue to the show."
            },
            {
                "name": "Last Week Tonight",
                "image": "https://static.next-episode.net/tv-shows-images/huge/last-week-tonight-with-john-oliver.jpg",
                "description": "I love this show because while I enjoy keeping up with the news, this show not only conveys the news in a humorous manner, but also manages to go really in-depth for each story and explain the contexts and details very well. This show is a great way to just passively spend time. My only gripe with the show is that many episodes don't age well: it's a show that one must keep up on, rather than binge-watch or rewatch."
            },
            {
                "name": "Avatar: The Last Airbender",
                "image": "https://cdn-images-1.medium.com/max/1600/0*zJajlQiZbHDdGGxG.",
                "description": "I have yet to meet anyone who dislikes Avatar: The Last Airbender. It is a great show that does great characterization and really develops its characters well and has a really novel and intriguing plot. I always end up rewatching this show every few years due to how well made and easily accessible this show is. My only gripe is that there are a few episodes that are really not worth watching, but considering that is the only downside, this show is truly something special."
            }
        ]
    },
    {
        "category": "Pokémon",
        "description": "Pokémon was about 50% of the time I spent during my elementary school. Past elementary school, I have spent more hours on the videogames than I care to admit. Regardless, I love Pokémon as a videogame franchise for all of its enjoyability and possible depth. These were a few of my favorite Pokémon in the videogames or conceptwise.",
        "items": [
            {
                "name": "Typhlosion",
                "image": "https://cdn.bulbagarden.net/upload/thumb/4/47/157Typhlosion.png/250px-157Typhlosion.png",
                "description": "Typhlosion was my first ever Pokémon. What was so endearing about Typhlosion was I initially didn't know about the ability to switch Pokémon, so I only ever used my Typhlosion, and it was my first level 100. Typhlosion forever endeared me to fire types."
            },
            {
                "name": "Emboar",
                "image": "https://cdn.bulbagarden.net/upload/thumb/1/18/500Emboar.png/250px-500Emboar.png",
                "description": "Pokémon Black and White were my favorite Pokémon games, and naturally, I chose Emboar due to my obsession with Fire-types."
            },
            {
                "name": "Staraptor",
                "image": "https://cdn.bulbagarden.net/upload/thumb/5/5e/398Staraptor.png/250px-398Staraptor.png",
                "description": "Staraptor was my first ever regularly used flying type, and it was on my permanent Pokémon Diamond team. Good memories."
            },
            {
                "name": "Luxray",
                "image": "https://cdn.bulbagarden.net/upload/thumb/a/a7/405Luxray.png/250px-405Luxray.png",
                "description": "Luxray was my first ever electric type, and I love the design and the type and everything about Luxray. Of course, Luxray isn't the best Pokémon, but I still had good memories with it."
            },
            {
                "name": "Aggron",
                "image": "https://cdn.bulbagarden.net/upload/thumb/6/6d/306Aggron.png/250px-306Aggron.png",
                "description": "Aggron looks cool. 'Nuff said."
            },
            {
                "name": "Infernape",
                "image": "https://cdn.bulbagarden.net/upload/thumb/f/fb/392Infernape.png/250px-392Infernape.png",
                "description": "Infernape is a cool monkey. It was also my first starter on Pokémon Diamond. While it was still novel, I really enjoyed the now overdone Fire-Fighting type."
            },
            {
                "name": "Seismitoad",
                "image": "https://cdn.bulbagarden.net/upload/thumb/3/35/537Seismitoad.png/250px-537Seismitoad.png",
                "description": "I didn't initially really like Water types because they were strong against fire, but Seismitoad was my first Water Pokémon that I used and enjoyed. Its Water-Ground typing makes it only susceptible to the elusive Grass type, which was I initially picked it up."
            }
        ]
    },
    {
        "category": "Video Games",
        "description": "Video Games are a part of my soul or essence. I cannot survive without Video Games, and a good game will keep my content for years. Videogames, much like TV Shows are a form of artwork, and I someday aspire to make a great game that can inspire others. These are a few games that I enjoy that really inspired me.",
        "items": [
            {
                "name": "Hollow Knight",
                "image": "https://steamcdn-a.akamaihd.net/steam/apps/367520/header.jpg?t=1524206817",
                "description": "I love myself some good world-building. Naturally, Hollow Knight is one of my favorite games because of its rich and deep lore. The story clues hidden throughout the game adds a nice touch and gives a nice reward to those who decide to do extra exploration. I also love the combat and fluidity of the game, which makes the difficult boss fights all the more fun. I love exploring the world, and I also love the platforming that all the hidden corners of the world have to offer. I can also not mention the great artwork and sountrack for this game. It shows how high quality Hollow Knight actually feels and how much work was poured into it. Hollow Knight is just a great game overall."
            },
            {
                "name": "Super Mario Galaxy",
                "image": "https://upload.wikimedia.org/wikipedia/en/thumb/7/76/SuperMarioGalaxy.jpg/220px-SuperMarioGalaxy.jpg",
                "description": "Super Mario Galaxy was one of my first games on the Wii. Not only did the space theme tickle my fancy, but I also enjoyed the gameplay. At the time, this game was difficult for me, but I still enjoyed the depth and detail that this game had achieved. This game isn't known as one of 'the greats' for nothing: exploration throughout all sorts of environments was an amazing idea for a game. The boss fights and mechanics were revolutionary to me at the time, as well as the depths that I could achieve with all the powerups, environments, and enemies. I also throughly enjoyed Super Mario Galaxy 2 and Super Mario Odyssey."
            },
            {
                "name": "The Legend of Zelda: The Minish Cap",
                "image": "https://cdn02.nintendo-europe.com/media/images/10_share_images/games_15/game_boy_advance_7/SI_GBA_TheLegendOfZeldaTheMinishCap_image1600w.jpg",
                "description": "Minish Cap was one of my first introductions to The Legend of Zelda Series, and it has been one of my favorite top down games. I enjoyed the combat and the exploration aspect of this game, as a staple of all Legend of Zelda games. I loved how it just had so much to do and many secrets to uncover. The dungeons and the story were quite good, and I especially loved the shrinking idea. The shrinking mechanic gave an extra layer of depth to each aspect of the map."
            },
            {
                "name": "The Legend of Zelda: Skyward Sword",
                "image": "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Legend_of_Zelda_Skyward_Sword_boxart.png/220px-Legend_of_Zelda_Skyward_Sword_boxart.png",
                "description": "While Skyward Sword has been disliked by many, it was one of my favorite, if not favorite, Legend of Zelda game. Like all Legend of Zelda games, I loved the inordinate amount of things to do, and I love how the game was essentially double of how much I thought it was going to be: after the first 3 areas, you learn that you need to redo a new version of all 3 areas. While the game was linear, I didn't mind it too much, as the storytelling and world-building of this game was really impactful to me. My only qualm with Skyward Sword was the pumpkin minigame being impossible but necessary for a heart container. As someone who tries to always 100% every videogame, that videogame forced me through hours of figurative blood, sweat, and tears."
            },
            {
                "name": "Terraria",
                "image": "https://images-na.ssl-images-amazon.com/images/I/A1rMTA3SciL.png",
                "description": "Terraria is one of my favorite games of all time. Whenever I have no commitments for a few months, Terraria is always my go-to to play. Terraria just has too many things to do with an infinite variety of ways to play. The aesthetic is charming and the gameplay is riveting. The soundtrack is also quite decent. Terraria often blew my mind with how much content and detail it had as an indie game for only $10. This game is a must-have for anyone with a computer. I have sunk over a 1000 hours into this great game. The combat is difficult yet excellent, and the exploration is great and satisfying. The game is also the definition of literally world-building. What isn't to like about Terraria? Even in the meta aspect, the developers are great, as they often release huge free updates. I always enjoy every playthrough of Terraria. I still, however, have yet to try Terraria hardcore."
            }
        ]
    }
]